tutorials/testcases/flowOverCylinder/cylinder_multiphase_neu/2d/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0; //5e-07;

boundaryField
{
    inlet
    {
        type            calculated; //zeroGradient;
	
	//type 		fixedValue;
        //value           $internalField;
    }
    outlet
    {
        type            calculated; //zeroGradient;
    }
    cylinder
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    sides
    {
        type            slip;
    }
    "inner|outer"
    {
        type            bellerophon;
        value           $internalField;
    }
}


// ************************************************************************* //
